import React, { useState } from "react";

const FAQSection = () => {
  const [openIndex, setOpenIndex] = useState(null);
  const questionSvg = (
    <svg
      viewBox="0 0 24 24"
      width="32px"
      height="32px"
      fill="currentColor"
      className="bg-[#E8F9FC] text-[#17A2B8] rounded-[50%] p-[3px] ml-2 flex-shrink-0"
    >
      <path d="M14.442 16.905c0-1.427-.177-2.564-.531-3.411-.322-.77-.931-1.612-1.827-2.525l-.734-.726c-.787-.786-1.298-1.361-1.533-1.726a3.775 3.775 0 0 1-.646-2.126c0-1.005.249-1.776.747-2.312.498-.536 1.23-.804 2.197-.804.93 0 1.676.26 2.241.782.565.522.847 1.233.847 2.133h3.921c-.028-1.905-.68-3.413-1.953-4.524C15.898.556 14.212 0 12.115 0 9.951 0 8.266.548 7.06 1.645 5.853 2.74 5.25 4.275 5.25 6.248c0 1.752.814 3.476 2.442 5.17l1.996 1.954c.709.813 1.072 1.991 1.092 3.533h3.662Zm.273 5.027c0-.642-.199-1.159-.596-1.551-.397-.393-.936-.59-1.616-.59-.69 0-1.233.204-1.63.611-.397.407-.596.917-.596 1.53 0 .584.194 1.075.582 1.472.387.397.936.596 1.644.596.709 0 1.255-.199 1.637-.596.384-.397.575-.888.575-1.472Z"></path>
    </svg>
  );

  const faqs = [
    {
      question: "چند روز قبل از پرواز، بلیط هواپیما را بخریم؟",
      answer:
        " امکان رزرو بلیط هواپیما از ماه‌ها قبل وجود دارد. اما گاهی اوقات قیمت بلیط هواپیما در روزهای نزدیک به پرواز ارزان‌تر می‌شود. بنابراین در صورتی که شرایطتان اجازه می‌دهد، رزرو آنلاین بلیط هواپیما را به روزهای نزدیک پرواز موکول کنید. البته اگر قصد سفر در ایام پرسفر نظیر تعطیلات را دارید، باید هر چه زودتر رزرو بلیط هواپیما را انجام دهید.",
    },
    {
      question: "در هر پرواز، میزان بار مجاز چقدر است؟",
      answer:
        "میزان بار مجاز به نوع پرواز (داخلی یا خارجی) و کلاس پروازی (اکونومی، بیزینس، فرست کلاس) بستگی دارد. معمولاً در پروازهای داخلی بین ۲۰ تا ۳۰ کیلوگرم بار مجاز دارید.",
    },
    {
      question:
        "آیا پس از خرید اینترنتی بلیط هواپیما امکان استرداد آن وجود دارد؟",
      answer:
        "بله، طبق قوانین سازمان هواپیمایی کشوری، شما تا ۴ ساعت قبل از پرواز میتوانید بلیط خود را با کسر جریمه استرداد کنید. میزان جریمه به زمان استرداد و نوع بلیط بستگی دارد.",
    },
    {
      question:
        "آیا پس از خرید اینترنتی بلیط هواپیما امکان تغییر نام وجود دارد؟",
      answer:
        "تغییر نام یا نام خانوادگی پس از خرید معمولاً امکان‌پذیر نیست و در صورت مغایرت اسم، ممکن است از سوار شدن شما جلوگیری شود. فقط در موارد خاص و با پرداخت جریمه میتوانید اصلاحات جزئی انجام دهید.",
    },
    {
      question: "چند روز قبل از پرواز، بلیط هواپیما را بخریم؟",
      answer:
        "امکان رزرو بلیط هواپیما از ماه‌ها قبل وجود دارد. اما گاهی اوقات قیمت بلیط هواپیما در روزهای نزدیک به پرواز ارزان‌ترمیزان مجاز بار به کلاس پرواز و کلاس نرخی بلیط بستگی دارد. هنگام خرید آنلاین بلیط هواپیما می‌توانید میزان بار مجاز را در اطلاعات بلیط ببینید. طبیعی است که اگر میزان بارتان بیش از حد مجاز باشد، باید جریمه پرداخت کنید. می‌شود. بنابراین در صورتی که شرایطتان اجازه می‌دهد، رزرو آنلاین بلیط هواپیما را به روزهای نزدیک پرواز موکول کنید. البته اگر قصد سفر در ایام پرسفر نظیر تعطیلات را دارید، باید هر چه زودتر رزرو بلیط هواپیما را انجام دهید.",
    },
    {
      question: "در هر پرواز، میزان بار مجاز چقدر است؟",
      answer:
        "میزان بار مجاز به نوع پرواز (داخلی یا خارجی) و کلاس پروازی (اکونومی، بیزینس، فرست کلاس) بستگی دارد. معمولاً در پروازهای داخلی بین ۲۰ تا ۳۰ کیلوگرم بار مجاز دارید.",
    },
    {
      question:
        "آیا پس از خرید اینترنتی بلیط هواپیما امکان استرداد آن وجود دارد؟",
      answer:
        "بله، طبق قوانین سازمان هواپیمایی کشوری، شما تا ۴ ساعت قبل از پرواز میتوانید بلیط خود را با کسر جریمه استرداد کنید. میزان جریمه به زمان استرداد و نوع بلیط بستگی دارد.",
    },
    {
      question:
        "آیا پس از خرید اینترنتی بلیط هواپیما امکان تغییر نام وجود دارد؟",
      answer:
        "تغییر نام یا نام خانوادگی پس از خرید معمولاً امکان‌پذیر نیست و در صورت مغایرت اسم، ممکن است از سوار شدن شما جلوگیری شود. فقط در موارد خاص و با پرداخت جریمه میتوانید اصلاحات جزئی انجام دهید.",
    },
  ];

  const toggleFAQ = (index) => {
    if (openIndex === index) {
      setOpenIndex(null);
    } else {
      setOpenIndex(index);
    }
  };

  return (
    <div className="w-full max-w-7xl mx-auto p-4 sm:p-5">
      <h2 className="text-black text-xl sm:text-2xl md:text-[1.5rem] font-bold pb-2.5">
        پرسش‌های شما
      </h2>
      <div className="border border-[#0000001f] rounded-lg w-full overflow-hidden">
        {faqs.map((faq, index) => (
          <div
            key={index}
            className={`w-full h-fit ${index !== faqs.length - 1 ? "border-b border-[#ddd]" : ""}`}
          >
            <div className="flex justify-between items-center">
              <button
                onClick={() => toggleFAQ(index)}
                className={`w-full text-right text-gray-500 text-sm sm:text-base font-bold py-3 sm:py-4 px-3 sm:px-5 border-none cursor-pointer flex items-center gap-2 transition-all duration-300 ${
                  openIndex === index
                    ? "bg-[#fff] text-black"
                    : "bg-white text-[#333] hover:bg-white"
                }`}
              >
                {questionSvg}
                <span className="text-right flex-1">{faq.question}</span>
              </button>
              <div
                onClick={() => toggleFAQ(index)}
                className={`ml-2 sm:ml-7 p-1 w-[28px] h-[28px] sm:w-[30px] sm:h-[30px] rounded-full text-gray-500 flex items-center justify-center flex-shrink-0
                  hover:bg-[#E8F9FC] 
                  hover:text-[#17A2B8]
                  focus:bg-[#E8F9FC]
                  focus:text-[#17A2B8]
                  transition-transform duration-300
                  ${openIndex === index ? "rotate-180" : ""}`}
              >
                <svg
                  viewBox="0 0 24 24"
                  width="1.2em"
                  height="1.2em"
                  fill="currentColor"
                  className="block"
                >
                  <path d="M21.266 7.302a.75.75 0 0 1 1.037 1.08l-.069.066-9.75 8.25a.75.75 0 0 1-.89.058l-.078-.058-9.75-8.25a.75.75 0 0 1 .893-1.202l.075.056L12 15.142l9.266-7.84Z"></path>
                </svg>
              </div>
            </div>

            {openIndex === index && (
              <div className="p-4 sm:p-7 mr-4 sm:mr-7 text-gray-500 text-sm sm:text-base">
                {faq.answer}
              </div>
            )}
          </div>
        ))}
      </div>
    </div>
  );
};

export default FAQSection;
