import Image from "next/image";

const Home = () => {
  return (
    <div className="w-full max-w-[1200px] mx-auto px-4 sm:px-6 lg:px-0">
      <div className="container flex-col">
        <div>
          <h1 className="my-3 text-grays-700 font-bold text-[22px]">
          </h1>
        </div>
        <div>
          <p className="text-[#4b5259] mb-10 text-3 font-bold text-justify">
            علی‌بابا، رتبه یک خرید اینترنتی بلیط سفر
          </p>
        </div>

        <div className="flex-col justify-around">
          <div className="flex flex-col lg:flex-row justify-between items-center gap-6 lg:gap-10">
            <div className="w-full lg:w-1/2 text-justify text-[#4b5259] leading-loose">
              <p>
                علی‌بابا، بزرگترین و معتبرترین پلتفرم خرید اینترنتی بلیط
                هواپیما، قطار و اتوبوس در کشور، از سال ۱۳۹۳ فعالیت خود را با هدف
                تسهیل خرید آنلاین خدمات سفر آغاز کرده و در این مدت توانسته است
                اعتماد و رضایت درصد بالایی از کاربران را جلب کند. این سامانه
                ابتدا با تمرکز بر فروش بلیط پرواز داخلی شروع به کار کرد و به‌طور
                تدریجی دامنه خدمات خود را به سایر محصولات گردشگری گسترش داد.
                امروز، علی بابا به یکی از معتبرترین و محبوب‌ترین سامانه‌های سفر
                در ایران تبدیل شده است. بر اساس نظرسنجی‌ها، 97.2 درصد از مشتریان
                علی‌بابا از کیفیت خدمات این پلتفرم رضایت کامل داشته و آن را به
                دوستان و آشنایان خود توصیه کرده‌اند. ویژگی‌هایی همچون سرعت و
                راحتی خرید آنلاین بلیط هواپیما داخلی، اعتبار و خوشنامی برند،
                امکان استرداد آنلاین بلیط هواپیما و پشتیبانی 24 ساعته در تمامی
                ایام هفته، موجب شده است که علی بابا جایگاه نخست در فروش بلیط در
                ایران را به خود اختصاص دهد.
              </p>
            </div>
            <div className="w-full lg:w-1/2 flex justify-center">
              <Image
                src="/images/ability1-image.webp"
                alt="ios-logo"
                width={480}
                height={348}
                className="w-full max-w-[400px] sm:max-w-[480px] h-auto"
              />
            </div>
          </div>

          {/* بخش متنی */}
          <div
            className="
              [&_div]:mb-8
              [&_span]:text-[#2b2f33] 
              [&_span]:text-4
              [&_span]:font-bold 
              [&_span]:block 
              [&_span]:mb-2 
              [&_p]:text-[#4b5259] 
              [&_p]:text-3
              [&_p]:text-justify
              [&_p]:leading-relaxed 
              [&_ul]:text-gray-700
              [&_ul]:leading-relaxed 
              [&_ul]:pr-6
              [&_ul]:list-disc 
              [&_li]:mb-2 
              [&_li]:text-gray-700"
          >
            <div>
              <div>
                <span> مزایای خرید بلیط هواپیما از علی‌بابا </span>
                <p>
                  شما با خرید بلیط هواپیما از علی‌بابا با سامانه مطمئن و معتبری
                  روبه‌رو هستید که تمام نیازهایتان را پاسخ می‌دهد. برای خرید
                  آنلاین بلیط هواپیما در علی‌بابا کافیست مبدا، مقصد و تاریخ
                  پرواز خود را انتخاب کنید. پس از کلیک روی جستجو، لیست{" "}
                  <b className="text-[#0077db]">قیمت بلیط هواپیما</b> به مقصد
                  مورد نظر شما ظاهر می‌شود. در این لیست، انتخابهای متعددی پیش
                  روی شماست. برای اینکه گزینه‌ ها را برای خرید بلیط هواپیما
                  محدودتر کنید، علی‌بابا ابزارهای مختلفی در اختیار شما می‌گذارد.
                </p>
              </div>
              <div>
                <span>تقویم قیمتی بلیط هواپیما</span>
                <p>
                  یکی از ابزارهای کاربردی و بسیار مفید علی بابا برای خرید
                  اینترنتی بلیط هواپیما، تقویم قیمتی است. با استفاده از این
                  تقویم، می‌توانید نوسانات قیمت بلیط پرواز داخلی در روزهای قبل و
                  بعد از تاریخ مورد نظر خود را به‌دقت بررسی کنید. اگر برای سفر
                  خود انعطاف‌پذیری دارید و الزام به خرید بلیط در تاریخ مشخصی
                  ندارید، این ابزار به شما کمک می‌کند تا با انتخاب روزهای
                  ارزان‌تر، رزرو بلیط هواپیمای خود را با هزینه به‌صرفه‌تری تهیه
                  کنید.
                </p>
              </div>
              <div>
                <span>فیلترهای پیشرفته جستجوی بلیط هواپیما</span>
                <p>
                  علاوه بر این، با استفاده از فیلترهای کنار صفحه می‌توانید
                  ایرلاین مورد نظرتان را انتخاب کنید. ضمنا می‌توانید،{" "}
                  <b className="text-[#0077db]">بلیط چارتر هواپیما</b> یا سیستمی
                  را فعال کنید تا فقط یکی از این دو نوع بلیط را مشاهده کنید.{" "}
                  <b className="text-[#0077db]">بلیط هواپیمای خارجی</b> ،کلاس
                  پروازی و زمان پرواز هم از دیگر گزینه‌هایی است که با انتخاب
                  آنها، تعداد بلیط ها محدودتر و رزرو بلیط هواپیما برای شما
                  آسانتر می‌شود.
                </p>
              </div>
              <div>
                <span>فیلترهای جستجو برای بلیط هواپیما داخلی : </span>

                <ul>
                  <li>انتخاب بلیط هواپیما داخلی بر اساس ساعت حرکت</li>
                  <li>انتخاب بر اساس نوع بلیط</li>
                  <li>فیلتر بلیط ها بر اساس کلاس پروازی</li>
                  <li>رزرو بلیط بر اساس شرکت های هواپیمایی داخلی ایران</li>
                </ul>
              </div>
              <div>
                <span>فیلترهای جستجوی بلیط هواپیما برای پرواز های خارجی:</span>

                <ul>
                  <li>انتخاب بلیط هواپیما بر اساس ساعت حرکت</li>
                  <li>انتخاب بلیط هواپیما بر اساس ساعت رسیدن به مقصد</li>
                  <li>
                    خرید بلیط پرواز بر اساس تعداد توقف ها: پرواز مستقیم – پرواز
                    با یک توقف و بلیط پرواز با دو توقف
                  </li>
                  <li>انتخاب پرواز های بدون توقف طولانی (بالای 4 ساعت)</li>
                  <li>
                    مشاهده بلیط پروازها بر اساس بار چمدان: بدون بار – بار بین 20
                    تا 40 کیلوگرم
                  </li>
                  <li>جستجوی بلیط های پروازی بر اساس تنظیم مدت زمان توقف</li>
                  <li>
                    انتخاب پرواز بر اساس مدت زمان سفر (بین 1 ساعت تا 27 ساعت)
                  </li>
                  <li>
                    فیلتر فرودگاه های مسیر برای مبدا، مقصد و فرودگاهای توقف در
                    طول پرواز
                  </li>
                  <li>انتخاب مدل هواپیما برای خرید بلیط پرواز</li>
                  <li>
                    فیلتر قیمتی که به شما کمک میکند تا قیمت بلیط هواپیما داخلی
                    را بر اساس بودجه خود تنظیم و مشاهده کنید
                  </li>
                </ul>
              </div>
              <div>
                <span>پرداخت آسان خرید بلیط هواپیما با کارت های شتاب</span>
                <p>
                  برای پرداخت هزینه می‌توانید از کارت شتاب استفاده کنید. پس از
                  پرداخت، خرید اینترنتی بلیط هواپیما با موفقیت انجام میشود و
                  بلیط به ایمیل شما ارسال میشود.
                </p>
              </div>
              <div>
                <span>پشتیبانی 24 ساعته علی بابا</span>
                <p>
                  در تمامی مراحل خرید بلیط، پشتیبانی 24 ساعته علی بابا همواره از
                  طریق سایت، اپلیکیشن، تماس تلفنی و ارسال تیکت در کنار شماست. هر
                  زمان که سوال یا مشکلی پیش آمد، می‌توانید با تیم پشتیبانی علی
                  بابا ارتباط برقرار کنید و به‌سرعت راهنمایی‌های لازم را دریافت
                  کنید.
                </p>
              </div>
              <div>
                <span>
                  رزرو بلیط هواپیما از معتبرترین و جامع ترین ایرلاین‌های پرواز
                  داخلی و خارجی
                </span>
                <p>
                  شما برای خرید بلیط هواپیما از بین ایرلاینهای مختلف حق انتخاب
                  دارید و می‌توانید از ایرلاینهای ماهان، زاگرس، کیش ایر، قشم
                  ایر، آسمان، کاسپین، تابان، وارش یا معراج، بلیط پرواز داخلی خود
                  را خریداری کنید. همچنین جهت خرید بلیط هواپیما برای مسیرهای
                  خارجی می‌توانید بلیط خود را از ایرلاین های IranAirtour,
                  QeshmAir, AirArabia, Mahan Airlines, Flydubai, Emirates, Ajet,
                  Qatar Airways, Turkish Airlines انتخاب نمایید. هر یک از این
                  ایرلاین‌ها دارای ویژگی‌ها و مزایای خاص خود هستند. برخی از
                  آن‌ها خدمات و امکانات رفاهی بیشتری ارائه می‌دهند، در حالی که
                  برخی دیگر قیمت بلیط هواپیما داخلی را بصورت اقتصادی‌تری ارائه
                  می‌کنند. این تنوع به شما این امکان را می‌دهد تا بر اساس نیازها
                  و اولویت‌های خود، مناسب‌ترین پرواز را انتخاب کنید.
                </p>
              </div>
              <div>
                <span>خرید بلیط برای مسیرهای پروازی مختلف داخلی</span>
                <p>
                  علی بابا امکان خرید بلیط هواپیما داخلی برای تمامی مسیرهای
                  پروازی را با تنوع گسترده‌ای از ایرلاین‌ها و قیمت‌های مختلف در
                  اختیار شما قرار می‌دهد. چه قصد سفر به شهرهای بزرگ مانند تهران،
                  مشهد، اصفهان داشته باشید یا به شهرهای کوچک‌تر، با رزرو آنلاین
                  بلیط هواپیما در علی‌بابا می‌توانید به‌راحتی و در کمترین زمان
                  پرواز خود را انتخاب و بلیطتان را تهیه کنید. خرید بلیط برای
                  مسیرهایی نظیر بلیط هواپیما تهران مشهد،{" "}
                  <b className="text-[#0077db]">
                    بلیط هواپیما تهران مشهد شیراز{" "}
                  </b>
                  و <b className="text-[#0077db]">پرواز تهران تبریز</b> از جمله
                  پرطرفدارترین و پرترددترین مسیرهای پروازی داخلی به شمار می‌آید.
                </p>
              </div>
              <div>
                <span>خرید بلیط برای مسیرهای پروازی مختلف خارجی</span>
                <p>
                  اگر به دنبال سفری به خارج از کشور هستید، علی‌بابا با ارائه
                  بلیط هواپیما به مقاصد بین‌المللی متنوع، تجربه‌ای راحت و سریع
                  برای رزرو آنلاین بلیط هواپیما فراهم می‌کند. از پرواز به
                  کشورهای همسایه مثل ترکیه و امارات گرفته تا مقاصد دورتر در
                  اروپا، آسیا یا آمریکا، می‌توانید از بین ایرلاین‌های معتبر بلیط
                  مناسب را انتخاب و خریداری کنید.
                </p>
              </div>
              <div>
                <span>امکان استرداد بلیط هواپیما در علی بابا</span>
                <p>
                  یکی از ویژگی‌های برجسته علی بابا، امکان استرداد آنلاین بلیط
                  هواپیما (کنسلی بلیط) است. در صورتی که پس از رزرو بلیط، برنامه
                  سفرتان تغییر کند، می‌توانید به‌سادگی و بر اساس قوانین استرداد
                  پرواز داخلی، بلیط هواپیمای خود را کنسل کنید. پس از تکمیل
                  فرایند استرداد، وجه پرداختی شما در کوتاه‌ترین زمان ممکن به
                  حساب شما برگشت داده می‌شود. خرید اینترنتی بلیط هواپیما از علی
                  بابا از طریق تلفن همراه، رایانه شخصی یا تبلت امکان‌پذیر است و
                  در تمامی این دستگاه‌ها، تجربه‌ای کاربرپسند و آسان خواهید داشت.
                  علاوه بر این، امکان نصب و استفاده از اپلیکیشن علی بابا برای
                  گوشی‌های اندروید و آیفون نیز فراهم است تا خرید بلیط هواپیما را
                  در هر زمان و مکان به راحتی انجام دهید.
                </p>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};
export default Home;